zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_TSI.h
#define TSI_GENCS_DMAEN_EOS_MASK                 (0x1U)
#define TSI_GENCS_DMAEN_EOS_SHIFT                (0U)
/*! DMAEN_EOS - In-Progress DMA Transfer Request Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_DMAEN_EOS(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DMAEN_EOS_SHIFT)) & TSI_GENCS_DMAEN_EOS_MASK)

#define TSI_GENCS_DMAEN_OUTRG_MASK               (0x4U)
#define TSI_GENCS_DMAEN_OUTRG_SHIFT              (2U)
/*! DMAEN_OUTRG - Out-of-Range DMA Transfer Request Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_DMAEN_OUTRG(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DMAEN_OUTRG_SHIFT)) & TSI_GENCS_DMAEN_OUTRG_MASK)

#define TSI_GENCS_STM_MASK                       (0x8U)
#define TSI_GENCS_STM_SHIFT                      (3U)
/*! STM - Scan Trigger Mode
 *  0b0..Software trigger scan
 *  0b1..Hardware trigger scan
 */
#define TSI_GENCS_STM(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_STM_SHIFT)) & TSI_GENCS_STM_MASK)

#define TSI_GENCS_STPE_MASK                      (0x10U)
#define TSI_GENCS_STPE_SHIFT                     (4U)
/*! STPE - TSI Stop Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_STPE(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_STPE_SHIFT)) & TSI_GENCS_STPE_MASK)

#define TSI_GENCS_TSIEN_MASK                     (0x20U)
#define TSI_GENCS_TSIEN_SHIFT                    (5U)
/*! TSIEN - TSI Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_TSIEN(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_TSIEN_SHIFT)) & TSI_GENCS_TSIEN_MASK)

#define TSI_GENCS_SWTS_MASK                      (0x80U)
#define TSI_GENCS_SWTS_SHIFT                     (7U)
/*! SWTS - Software Trigger Start
 *  0b0..No effect
 *  0b1..Takes effect
 */
#define TSI_GENCS_SWTS(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_SWTS_SHIFT)) & TSI_GENCS_SWTS_MASK)

#define TSI_GENCS_CTRIM_FINE_MASK                (0xE00U)
#define TSI_GENCS_CTRIM_FINE_SHIFT               (9U)
/*! CTRIM_FINE - Capacitor Fine Trim
 *  0b000..0.3125 pF
 *  0b001..0.625 pF
 *  0b010..0.3125 * 3 pF
 *  0b011..0.3125 * 4 pF
 *  0b100..0.3125 * 5 pF
 *  0b101..0.3125 * 6 pF
 *  0b110..2.1875 pF
 *  0b111..2.5 pF
 */
#define TSI_GENCS_CTRIM_FINE(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_CTRIM_FINE_SHIFT)) & TSI_GENCS_CTRIM_FINE_MASK)

#define TSI_GENCS_DVOLT_MASK                     (0x7000U)
#define TSI_GENCS_DVOLT_SHIFT                    (12U)
/*! DVOLT - Delta Voltage
 *  0b000..Vm = 0.6 V, Vp = 1.7 V
 *  0b001..Vm = 0.6 V, Vp = 1.9 V
 *  0b010..Vm = 0.6 V, Vp = 2.1 V
 *  0b011..Vm = 0.6 V, Vp = 2.3 V
 *  0b100..Vm = 0.6 V, Vp = 2.5 V
 *  0b101..Vm = 0.6 V, Vp = 2.7 V
 */
#define TSI_GENCS_DVOLT(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DVOLT_SHIFT)) & TSI_GENCS_DVOLT_MASK)

#define TSI_GENCS_DEBOUNCE_MASK                  (0x1F0000U)
#define TSI_GENCS_DEBOUNCE_SHIFT                 (16U)
/*! DEBOUNCE - Debounce
 *  0b00000..1
 *  0b00001..2
 *  0b11111..31
 *  0b1xxxx..n
 */
#define TSI_GENCS_DEBOUNCE(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_DEBOUNCE_SHIFT)) & TSI_GENCS_DEBOUNCE_MASK)

#define TSI_GENCS_S_PROX_EN_MASK                 (0x400000U)
#define TSI_GENCS_S_PROX_EN_SHIFT                (22U)
/*! S_PROX_EN - Proximity Enable Signal
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_S_PROX_EN(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_S_PROX_EN_SHIFT)) & TSI_GENCS_S_PROX_EN_MASK)

#define TSI_GENCS_SETCLK_MASK                    (0x7000000U)
#define TSI_GENCS_SETCLK_SHIFT                   (24U)
/*! SETCLK - Set Clock
 *  0b000..27.37 MHz
 *  0b001..22.23 MHz
 *  0b010..18.73 MHz
 *  0b011..16.65 MHz
 *  0b100..14.27 MHz
 *  0b101..12.73 MHz
 *  0b110..11.49 MHz
 *  0b111..10.46 MHz
 */
#define TSI_GENCS_SETCLK(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_SETCLK_SHIFT)) & TSI_GENCS_SETCLK_MASK)

#define TSI_GENCS_ESOR_MASK                      (0x8000000U)
#define TSI_GENCS_ESOR_SHIFT                     (27U)
/*! ESOR - End-of-Scan Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_ESOR(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_ESOR_SHIFT)) & TSI_GENCS_ESOR_MASK)

#define TSI_GENCS_OUTRG_EN_MASK                  (0x40000000U)
#define TSI_GENCS_OUTRG_EN_SHIFT                 (30U)
/*! OUTRG_EN - Out-of-Range Interrupt Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_GENCS_OUTRG_EN(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_GENCS_OUTRG_EN_SHIFT)) & TSI_GENCS_OUTRG_EN_MASK)
/*! @} */

/*! @name MUL - TSI Mutual-Capacitance */
/*! @{ */

#define TSI_MUL_M_VPRE_CHOOSE_MASK               (0x2U)
#define TSI_MUL_M_VPRE_CHOOSE_SHIFT              (1U)
/*! M_VPRE_CHOOSE - Mutual-Capacitance Prevoltage
 *  0b0..Internal 1.2 V
 *  0b1..External 1.2 V from PMC
 */
#define TSI_MUL_M_VPRE_CHOOSE(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_VPRE_CHOOSE_SHIFT)) & TSI_MUL_M_VPRE_CHOOSE_MASK)

#define TSI_MUL_M_MODE_MASK                      (0x4U)
#define TSI_MUL_M_MODE_SHIFT                     (2U)
/*! M_MODE - Mutual-Capacitance Mode
 *  0b0..- 5 V ~ + 5 V
 *  0b1..0 V ~ + 5 V
 */
#define TSI_MUL_M_MODE(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_MODE_SHIFT)) & TSI_MUL_M_MODE_MASK)

#define TSI_MUL_M_TRIM_CAP_MASK                  (0x18U)
#define TSI_MUL_M_TRIM_CAP_SHIFT                 (3U)
/*! M_TRIM_CAP - Mutual-Capacitance Trim Cap
 *  0b00..0 pF
 *  0b01..10 pF
 *  0b10..10 pF
 *  0b11..20 pF
 */
#define TSI_MUL_M_TRIM_CAP(x)                    (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_TRIM_CAP_SHIFT)) & TSI_MUL_M_TRIM_CAP_MASK)

#define TSI_MUL_M_TX_USED_MASK                   (0x1FE0U)
#define TSI_MUL_M_TX_USED_SHIFT                  (5U)
/*! M_TX_USED - Mutual-Capacitance TX Used
 *  0b00000000..GPIO
 *  0b00000001..Mutual capacitance
 */
#define TSI_MUL_M_TX_USED(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_TX_USED_SHIFT)) & TSI_MUL_M_TX_USED_MASK)

#define TSI_MUL_M_TRIM_MASK                      (0xFFFF0000U)
#define TSI_MUL_M_TRIM_SHIFT                     (16U)
/*! M_TRIM - Mutual-Capacitance Trim */
#define TSI_MUL_M_TRIM(x)                        (((uint32_t)(((uint32_t)(x)) << TSI_MUL_M_TRIM_SHIFT)) & TSI_MUL_M_TRIM_MASK)
/*! @} */

