zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_TSI.h
#define TSI_SSC1_PRBS_SEED_HI_MASK               (0xFF00U)
#define TSI_SSC1_PRBS_SEED_HI_SHIFT              (8U)
/*! PRBS_SEED_HI - PRBS High Seed */
#define TSI_SSC1_PRBS_SEED_HI(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_SEED_HI_SHIFT)) & TSI_SSC1_PRBS_SEED_HI_MASK)

#define TSI_SSC1_PRBS_WEIGHT_LO_MASK             (0xFF0000U)
#define TSI_SSC1_PRBS_WEIGHT_LO_SHIFT            (16U)
/*! PRBS_WEIGHT_LO - PRBS Low Weight */
#define TSI_SSC1_PRBS_WEIGHT_LO(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_LO_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_LO_MASK)

#define TSI_SSC1_PRBS_WEIGHT_HI_MASK             (0xFF000000U)
#define TSI_SSC1_PRBS_WEIGHT_HI_SHIFT            (24U)
/*! PRBS_WEIGHT_HI - PRBS High Weight */
#define TSI_SSC1_PRBS_WEIGHT_HI(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC1_PRBS_WEIGHT_HI_SHIFT)) & TSI_SSC1_PRBS_WEIGHT_HI_MASK)
/*! @} */

/*! @name SSC2 - TSI SSC 2 */
/*! @{ */

#define TSI_SSC2_MOVE_REPEAT_NUM_MASK            (0x1FU)
#define TSI_SSC2_MOVE_REPEAT_NUM_SHIFT           (0U)
/*! MOVE_REPEAT_NUM - Move Repeat Number
 *  0b00000..1
 *  0b00001..2
 *  0b00010..3
 *  0b00011..4
 *  0b00100..5
 *  0b00101..6
 *  0b00110..7
 */
#define TSI_SSC2_MOVE_REPEAT_NUM(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_REPEAT_NUM_SHIFT)) & TSI_SSC2_MOVE_REPEAT_NUM_MASK)

#define TSI_SSC2_MOVE_STEPS_NUM_MASK             (0x700U)
#define TSI_SSC2_MOVE_STEPS_NUM_SHIFT            (8U)
/*! MOVE_STEPS_NUM - Move Steps Number
 *  0b000..0
 *  0b001..1
 *  0b010..2
 *  0b011..3
 *  0b100..4
 *  0b101..5
 *  0b110..6
 *  0b111..7
 */
#define TSI_SSC2_MOVE_STEPS_NUM(x)               (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_STEPS_NUM_SHIFT)) & TSI_SSC2_MOVE_STEPS_NUM_MASK)

#define TSI_SSC2_MOVE_NOCHARGE_MAX_MASK          (0x3F0000U)
#define TSI_SSC2_MOVE_NOCHARGE_MAX_SHIFT         (16U)
/*! MOVE_NOCHARGE_MAX - Move Nocharge Maximum */
#define TSI_SSC2_MOVE_NOCHARGE_MAX(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_NOCHARGE_MAX_SHIFT)) & TSI_SSC2_MOVE_NOCHARGE_MAX_MASK)

#define TSI_SSC2_MOVE_NOCHARGE_MIN_MASK          (0xF0000000U)
#define TSI_SSC2_MOVE_NOCHARGE_MIN_SHIFT         (28U)
/*! MOVE_NOCHARGE_MIN - Move Nocharge Minimum
 *  0b0000..(1 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0001..(2 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0010..(3 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0011..(4 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0100..(5 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0101..(6 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0110..(7 + SSC0[BASE_NOCHARGE_NUM])
 *  0b0111..(8 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1000..(9 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1001..(10 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1010..(11 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1011..(12 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1100..(13 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1101..(14 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1110..(15 + SSC0[BASE_NOCHARGE_NUM])
 *  0b1111..(16 + SSC0[BASE_NOCHARGE_NUM])
 */
#define TSI_SSC2_MOVE_NOCHARGE_MIN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_SSC2_MOVE_NOCHARGE_MIN_SHIFT)) & TSI_SSC2_MOVE_NOCHARGE_MIN_MASK)
/*! @} */

/*! @name BASELINE - TSI Baseline */
/*! @{ */

#define TSI_BASELINE_BASELINE_MASK               (0xFFFFU)
#define TSI_BASELINE_BASELINE_SHIFT              (0U)
/*! BASELINE - Baseline */
#define TSI_BASELINE_BASELINE(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_BASELINE_SHIFT)) & TSI_BASELINE_BASELINE_MASK)

#define TSI_BASELINE_BASE_TRACE_DEBOUNCE_MASK    (0xF0000U)
#define TSI_BASELINE_BASE_TRACE_DEBOUNCE_SHIFT   (16U)
/*! BASE_TRACE_DEBOUNCE - Base Trace Debounce
 *  0b0000..0
 *  0b0001..1 / 16
 *  0b0010..2 / 16
 *  0b0011..3 / 16
 *  0b1111..15 / 16
 *  0b1xxx..n / 16
 */
#define TSI_BASELINE_BASE_TRACE_DEBOUNCE(x)      (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_BASE_TRACE_DEBOUNCE_SHIFT)) & TSI_BASELINE_BASE_TRACE_DEBOUNCE_MASK)

#define TSI_BASELINE_BASE_TRACE_EN_MASK          (0x100000U)
#define TSI_BASELINE_BASE_TRACE_EN_SHIFT         (20U)
/*! BASE_TRACE_EN - Baseline Trace Enable */
#define TSI_BASELINE_BASE_TRACE_EN(x)            (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_BASE_TRACE_EN_SHIFT)) & TSI_BASELINE_BASE_TRACE_EN_MASK)

#define TSI_BASELINE_THESHOLD_RATIO_MASK         (0x70000000U)
#define TSI_BASELINE_THESHOLD_RATIO_SHIFT        (28U)
/*! THESHOLD_RATIO - Threshold Ratio
 *  0b000..thresholdh = (baseline + counter) / 2 and thresholdl = (baseline - counter) / 2
 *  0b001..thresholdh = (baseline + counter) / 4 and thresholdl = (baseline - counter) / 4
 *  0b010..thresholdh = (baseline + counter) / 8 and thresholdl = (baseline - counter) / 8
 *  0b011..thresholdh = (baseline + counter) / 16 and thresholdl = (baseline - counter) / 16
 *  0b100..thresholdh = (baseline + counter) / 32 and thresholdl = (baseline - counter) / 32
 *  0b101..thresholdh = (baseline + counter) / 64 and thresholdl = (baseline - counter) / 64
 *  0b110..thresholdh = (baseline + counter) / 128 and thresholdl = (baseline - counter) / 128
 *  0b111..thresholdh = (baseline + counter) / 256 and thresholdl = (baseline - counter) / 256
 */
#define TSI_BASELINE_THESHOLD_RATIO(x)           (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_THESHOLD_RATIO_SHIFT)) & TSI_BASELINE_THESHOLD_RATIO_MASK)

#define TSI_BASELINE_THRESHOLD_TRACE_EN_MASK     (0x80000000U)
#define TSI_BASELINE_THRESHOLD_TRACE_EN_SHIFT    (31U)
/*! THRESHOLD_TRACE_EN - Threshold Trace Enable
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_BASELINE_THRESHOLD_TRACE_EN(x)       (((uint32_t)(((uint32_t)(x)) << TSI_BASELINE_THRESHOLD_TRACE_EN_SHIFT)) & TSI_BASELINE_THRESHOLD_TRACE_EN_MASK)
/*! @} */

/*! @name CHMERGE - TSI Channel Merge */
/*! @{ */

#define TSI_CHMERGE_CHANNEL_ENABLE_MASK          (0x1FFFFFFU)
#define TSI_CHMERGE_CHANNEL_ENABLE_SHIFT         (0U)
/*! CHANNEL_ENABLE - Channel Enable
 *  0b0000000000000000000000000..Channel not chosen for proximity pad
 *  0b0000000000000000000000001..Channel chosen for proximity pad
 */
#define TSI_CHMERGE_CHANNEL_ENABLE(x)            (((uint32_t)(((uint32_t)(x)) << TSI_CHMERGE_CHANNEL_ENABLE_SHIFT)) & TSI_CHMERGE_CHANNEL_ENABLE_MASK)
/*! @} */

