zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXN/periph/PERI_TSI.h
/*! @name SHIELD - TSI Shield */
/*! @{ */

#define TSI_SHIELD_SHIELD_ENABLE_MASK            (0xFU)
#define TSI_SHIELD_SHIELD_ENABLE_SHIFT           (0U)
/*! SHIELD_ENABLE - Shield Enable
 *  0b0000..Disables
 *  0b0001..Enables
 */
#define TSI_SHIELD_SHIELD_ENABLE(x)              (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_SHIELD_ENABLE_SHIFT)) & TSI_SHIELD_SHIELD_ENABLE_MASK)

#define TSI_SHIELD_M_SEN_RES_MASK                (0x7E000000U)
#define TSI_SHIELD_M_SEN_RES_SHIFT               (25U)
/*! M_SEN_RES - Mutual-Capacitance Sensitivity Resistor
 *  0b000000..10 kΩ
 *  0b000001..10 kΩ + (2.5 / 3) kΩ (just for auto-calibration)
 *  0b000010..12.5 kΩ (default)
 *  0b001110..25 kΩ
 */
#define TSI_SHIELD_M_SEN_RES(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_SHIELD_M_SEN_RES_SHIFT)) & TSI_SHIELD_M_SEN_RES_MASK)
/*! @} */

/*! @name DATA - TSI Data and Status */
/*! @{ */

#define TSI_DATA_TSICNT_MASK                     (0xFFFFU)
#define TSI_DATA_TSICNT_SHIFT                    (0U)
/*! TSICNT - TSI Conversion Counter Value */
#define TSI_DATA_TSICNT(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_DATA_TSICNT_SHIFT)) & TSI_DATA_TSICNT_MASK)

#define TSI_DATA_EOSF_MASK                       (0x8000000U)
#define TSI_DATA_EOSF_SHIFT                      (27U)
/*! EOSF - End-of-Scan Flag */
#define TSI_DATA_EOSF(x)                         (((uint32_t)(((uint32_t)(x)) << TSI_DATA_EOSF_SHIFT)) & TSI_DATA_EOSF_MASK)

#define TSI_DATA_OVERRUNF_MASK                   (0x20000000U)
#define TSI_DATA_OVERRUNF_SHIFT                  (29U)
/*! OVERRUNF - Overrun Flag
 *  0b0..No
 *  0b1..Yes
 */
#define TSI_DATA_OVERRUNF(x)                     (((uint32_t)(((uint32_t)(x)) << TSI_DATA_OVERRUNF_SHIFT)) & TSI_DATA_OVERRUNF_MASK)

#define TSI_DATA_OUTRGF_MASK                     (0x40000000U)
#define TSI_DATA_OUTRGF_SHIFT                    (30U)
/*! OUTRGF - Out-of-Range Flag */
#define TSI_DATA_OUTRGF(x)                       (((uint32_t)(((uint32_t)(x)) << TSI_DATA_OUTRGF_SHIFT)) & TSI_DATA_OUTRGF_MASK)
/*! @} */

/*! @name MISC - TSI Miscellaneous */
/*! @{ */

#define TSI_MISC_OSC_CLK_SEL_MASK                (0x80000U)
#define TSI_MISC_OSC_CLK_SEL_SHIFT               (19U)
/*! OSC_CLK_SEL - Oscillator Clock Select
 *  0b0..Analog oscillator
 *  0b1..Chip
 */
#define TSI_MISC_OSC_CLK_SEL(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MISC_OSC_CLK_SEL_SHIFT)) & TSI_MISC_OSC_CLK_SEL_MASK)

#define TSI_MISC_TEST_FINGER_MASK                (0x700000U)
#define TSI_MISC_TEST_FINGER_SHIFT               (20U)
/*! TEST_FINGER - Test Finger
 *  0b000..Finger capacitor is 148 pF
 *  0b001..Finger capacitor is 296 pF
 *  0b010..Finger capacitor is 444 pF
 *  0b011..Finger capacitor is 592 pF
 *  0b100..Finger capacitor is 740 pF
 *  0b101..Finger capacitor is 888 pF
 *  0b110..Finger capacitor is 1036 pF
 *  0b111..Finger capacitor is 1184 pF
 */
#define TSI_MISC_TEST_FINGER(x)                  (((uint32_t)(((uint32_t)(x)) << TSI_MISC_TEST_FINGER_SHIFT)) & TSI_MISC_TEST_FINGER_MASK)

#define TSI_MISC_TEST_FINGER_EN_MASK             (0x800000U)
#define TSI_MISC_TEST_FINGER_EN_SHIFT            (23U)
/*! TEST_FINGER_EN - Test Finger Function Enable Signals
 *  0b0..Disables
 *  0b1..Enables
 */
#define TSI_MISC_TEST_FINGER_EN(x)               (((uint32_t)(((uint32_t)(x)) << TSI_MISC_TEST_FINGER_EN_SHIFT)) & TSI_MISC_TEST_FINGER_EN_MASK)

#define TSI_MISC_CLKDIVIDER_MASK                 (0x1F000000U)
#define TSI_MISC_CLKDIVIDER_SHIFT                (24U)
/*! CLKDIVIDER - TSI Clock Divider */
#define TSI_MISC_CLKDIVIDER(x)                   (((uint32_t)(((uint32_t)(x)) << TSI_MISC_CLKDIVIDER_SHIFT)) & TSI_MISC_CLKDIVIDER_MASK)
/*! @} */

/*! @name TRIG - TSI AUTO TRIG */
/*! @{ */

#define TSI_TRIG_TRIG_PERIOD_COUNTER_MASK        (0xFFFFFU)
#define TSI_TRIG_TRIG_PERIOD_COUNTER_SHIFT       (0U)
/*! TRIG_PERIOD_COUNTER - Trigger Period Counter */
#define TSI_TRIG_TRIG_PERIOD_COUNTER(x)          (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_PERIOD_COUNTER_SHIFT)) & TSI_TRIG_TRIG_PERIOD_COUNTER_MASK)

#define TSI_TRIG_TRIG_CLK_DIVIDER_MASK           (0x1F000000U)
#define TSI_TRIG_TRIG_CLK_DIVIDER_SHIFT          (24U)
/*! TRIG_CLK_DIVIDER - Trigger Clock Divider
 *  0b00000..No divider
 *  0b00001..Divided by 2
 *  0b00010..Divided by 3
 *  0b00011..Divided by 4
 *  0b1xxxx..Divided by n
 */
#define TSI_TRIG_TRIG_CLK_DIVIDER(x)             (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_CLK_DIVIDER_SHIFT)) & TSI_TRIG_TRIG_CLK_DIVIDER_MASK)

#define TSI_TRIG_TRIG_EN_MASK                    (0x40000000U)
#define TSI_TRIG_TRIG_EN_SHIFT                   (30U)
/*! TRIG_EN - Trigger Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define TSI_TRIG_TRIG_EN(x)                      (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_EN_SHIFT)) & TSI_TRIG_TRIG_EN_MASK)

#define TSI_TRIG_TRIG_CLK_SEL_MASK               (0x80000000U)
#define TSI_TRIG_TRIG_CLK_SEL_SHIFT              (31U)
/*! TRIG_CLK_SEL - Trigger Clock Select
 *  0b0..32 k clock
 *  0b1..clksoc
 */
#define TSI_TRIG_TRIG_CLK_SEL(x)                 (((uint32_t)(((uint32_t)(x)) << TSI_TRIG_TRIG_CLK_SEL_SHIFT)) & TSI_TRIG_TRIG_CLK_SEL_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group TSI_Register_Masks */


/*!
 * @}
 */ /* end of group TSI_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_TSI_H_ */

